org/posts/abv_mails.org
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK")
#+OPTIONS: date:t e:t email:nil f:t inline:t num:t p:nil pri:nil
#+OPTIONS: prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t
#+OPTIONS: toc:t todo:t |:t


#+TITLE: ABV Emails Retrieval
#+OPTIONS: ':nil -:nil ^:{} num:nil toc:nil
#+AUTHOR: Stanislav Arnaudov
#+DATE: <2019-04-19 Thu>
#+EMAIL: stanislav_ts@abv.bg
#+CREATOR: Emacs 26.1 (Org mode 9.2.1 + ox-hugo)
#+HUGO_FRONT_MATTER_FORMAT: toml
#+HUGO_LEVEL_OFFSET: 1
#+HUGO_PRESERVE_FILLING:
#+HUGO_SECTION: posts
#+HUGO_BASE_DIR: ~/code/blog-hugo-files/
#+HUGO_PREFER_HYPHEN_IN_TAGS: t 
#+HUGO_ALLOW_SPACES_IN_TAGS: nil
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_DATE_FORMAT: %Y-%m-%dT%T%z
#+DESCRIPTION: A short walkthrough of how I downloaded all of my emails from an obscure email provider.
#+HUGO_DRAFT: true
#+KEYWORDS: email unix-tools 
#+HUGO_TAGS: 
#+HUGO_CATEGORIES: other
#+HUGO_WEIGHT: 100


* Abstract


So for several years now I've been fed up with the email provider that I've been using. I choose it - or there it was chosen for me by my dad - in my most early internet days. Because of its early 
inception, the email has accumulated an enormous amount of emails over the years. Currently I have around 7000 emails. Yes, the majority of them are useless spam but I /really/ don't want to go over all of them and clean them up. I also have sort of a sentimental attachment to all of the junk and I do have my hopes to go over everything some day and discover some "gems". I am a giant hoarder is what I am trying to say.
\\
\\
The email provider in question is [[https://www.abv.bg/][ABV]]. It's a Bulgarian thing and even in Bulgaria everyone makes fun of it but somehow I am still using it. The problem with /ABV/ (or one of its problems) is the lack of [[https://en.wikipedia.org/wiki/Internet_Message_Access_Protocol][IMAP]] support. Only access to your email over the POP3 protocol is offered. This sucks as it means I can't fully control my email through separate clients. I must always log through the web interface, if I want to do even basic management. Archiving my emails is also impossible as well as keeping by emails and boxes offline. [[https://bg.wikipedia.org/wiki/Post_Office_Protocol][POP3]] offers only rudmimetranry read only access to your unread emails which is quite limiting.
\\
\\
All of this makes working with /ABV/ incredibly annoying. I want to make a switch, but my emails for the past 10 years are there and I can't have them elsewhere.
\\
\\
Needless to say, I had to do some "hacking" in order to solve my problem. So let me take you on a journey.
\\
\\
/Note:/ I am using GNU\Linux and the post assumes you are at least a little bit familiar with working on the terminal (in Bourne shell) in Unix like systems.


* Abusing the Firefox's network analysis tools


** An observation

As already said, /ABV/ does not support /IMAP/. There is, however, a button in the web interface to download an individual email. It shows up only when you open a separate email, so I can't "select & download all" them. Still, the ability to download a single email opens... some opportunities to say at least. I did some inspection with the [[https://developer.mozilla.org/en-US/docs/Tools/Network_Monitor][network tools of Firefox]] and I've found out that the download button makes a HTTP GET request to an URL of the following form:
#+BEGIN_SRC url
https://nm40.abv.bg/email/msgdownload?mid=15493841873&fid=10
#+END_SRC
Interesting! I assumed that the ~mid~ parameter is probably the message id and the ~fid~ is "folder id" (maybe?). So OK, it turns out that /ABV/ has an exposed API for downloading emails. If I somehow get the ids of all my emails, maybe I would be able to abuse the endpoint in some automatic way.
\\
\\
A thing to note is that the downloaded file is in /.eml/ format. I wasn't familiar with the format but a [[https://fileinfo.com/extension/eml][quick google search]] told me that this is standard for emails and the whole information about the email is there. Attachments included! This is quite xconvenient as if I had all of my emails in /.eml/ format, I would essentially have all of the information about the emails that is currently on the /ABV/ servers.


