content/posts/abv_mails.md
+++
title = "ABV Emails Retrieval"
author = ["Stanislav Arnaudov"]
description = "A short walkthrough of how I downloaded all of my emails from an obscure email provider."
date = 2019-05-11T00:00:00+02:00
keywords = ["email", "unix-tools"]
lastmod = 2019-10-21T22:18:09+02:00
categories = ["other"]
draft = false
weight = 100
+++

## Abstract {#abstract}

So for several years now, I've been fed up with the email provider that I've been using. I choose it - or there it was chosen for me by my dad - in my most early internet days. Because of its early inception, the email has accumulated an enormous amount of emails over the years. Currently, I have around 7000 emails. Yes, the majority of them are useless spam but I _really_ don't want to go over all of them and clean them up. I also have sort of a sentimental attachment to all of the junk and I do have my hopes to go over everything someday and discover some "gems". I am a giant hoarder is what I am trying to say.

<br />

The email provider in question is [ABV](https://www.abv.bg/). It's a Bulgarian thing and even in Bulgaria everyone makes fun of it but somehow I am still using it. The problem with _ABV_ (or one of its problems) is the lack of [IMAP](https://en.wikipedia.org/wiki/Internet%5FMessage%5FAccess%5FProtocol) support. POP3 is the only offered protocol for access to your email. This sucks as it means I can't fully control my email through separate clients. I must always log through the web interface if I want to do even basic management. Archiving my emails is also impossible as well as keeping by emails and boxes offline. [POP3](https://bg.wikipedia.org/wiki/Post%5FOffice%5FProtocol) offers only rudimentary read-only access to your unread emails which is quite limiting.

<br />

All of this makes working with _ABV_ incredibly annoying. I want to make a switch, but my emails for the past 10 years are there and I can't have them elsewhere.

<br />

Needless to say, I had to do some "hacking" to solve my problem. So let me take you on a journey.

<br />

_Note:_ I am using GNU\Linux and the post assumes you are at least a little bit familiar with working on the terminal (in Bourne shell) in Unix like systems.


## Abusing the Firefox's network analysis tools {#abusing-the-firefox-s-network-analysis-tools}


### An observation {#an-observation}

As already said, _ABV_ does not support _IMAP_. There is, however, a button in the web interface to download an individual email. It shows up only when you open a separate email, so I can't "select & download all" them. Still, the ability to download a single email opens... some opportunities to say at least. I did some inspection with the [network tools of Firefox](https://developer.mozilla.org/en-US/docs/Tools/Network%5FMonitor) and I've found out that the download button makes an HTTP GET request to an URL of the following form:

```url
https://nm40.abv.bg/email/msgdownload?mid=15493841873&fid=10
```

Interesting! I assumed that the `mid` parameter is probably the message-id and the `fid` is "folder id" (maybe?). So OK, it turns out that _ABV_ has an exposed API for downloading emails. If I somehow get the ids of all my emails, maybe I would be able to abuse the endpoint in some automatic way. <br /> <br /> A thing to note is that the downloaded file is in _.eml_ format. I wasn't familiar with the format but a [quick google search](https://fileinfo.com/extension/eml) told me that this is standard for emails and the whole information about the email is there. Attachments included! This is quite convenient as if I had all of my emails in _.eml_ format, I would essentially have all of the information about the emails that are currently on the _ABV_ servers.
