content/posts/abv_mails.md


### Getting the information {#getting-the-information}

The tasks then became finding the ids of all of my emails. _How on earth was I supposed to do that?_ <br /> <br /> I did some playing around with the network's tool while more or less doing random things in the web interface of the email provider. At one point I deleted an email and I saw some post requests being made to somewhere (I don't care about their damn server). I looked at the request payload and it was something like:

```sh
sh7|2|14|https://nm40.abv.bg/mail/|A9281AB8DC456492EBCF569B4D467239|com.google.gwt.user.client.rpc.XsrfToken/4254043109|92B3E106F93030263CA9346A878A5C38|bg.abv.mail.sg.client.service.InboxService|moveMessages|J|java.lang.String/2004016611|I|[Ljava.lang.String;/2600011424|msg_id|desc||15486542791|1|2|3|4|5|6|8|7|7|8|8|8|9|10|7|K|Ba|11|12|13|0|10|1|14|ObqbBk|
```

I haven't seen such format and by now I only expect [JSON](https://www.json.org/) strings in requests but I am not huge on web development so I have no idea what am I talking about. Anyway, when you pay a little bit of closer attention, you'll see that there is a number in the payload - `1548654279` - which looks suspiciously similar to the number of the `mid` parameter of the download email API. I restored the email from the trash and I tried calling the previous URL with this message id - `1548654279`. And boom! It prompted me to download the previously deleted and restored email. I was onto something! <br /> <br /> A little bit more playing and I had an idea. What if I create a temporary email box and I transfer all of the emails from the inbox there. The client must somehow tell the server to move the emails. Maybe I can then look at the request and the ids will be there. <br /> <br /> I proceeded with my plan and it almost went well. The thing was, probably because of the large number of emails that I have, the client was sending several post requests to the server. I assumed every request was moving some parts of the emails. I inspected the payload of one of the requests and this was there

{{< highlight sh "linenos=table, linenostart=1" >}}
7|2|108|https://nm40.abv.bg/mail/|A9281AB8DC456492EBCF569B4D467239|com.google.gwt.user.client.rpc.XsrfToken/4254043109|92B3E106F93030263CA9346A878A5C38|bg.abv.mail.sg.client.service.InboxService|moveM
essages|J|[Ljava.lang.String;/2600011424|15496357640|15496349933|15493841873|15491365378|15488910522|15488667774|15488660586|15488525888|15488053264|15487848360|15487912098|15486818166|15485039543|154
84640093|15484637666|15484550681|15483826724|15482043396|15481236007|15480216745|15479965022|15479943539|15479891587|15479382334|15478811147|15475565022|15475419857|15475370542|15475073151|15474052961
|15471770500|15471406374|15470918112|15468683208|15467229194|15467152209|15467142650|15466683573|15466504143|15466333339|15466281862|15466292312|15465558833|15465107279|15464506738|15464449485|1546431
6403|15463881116|15462160256|15460884410|15453412832|15453375839|15452559978|15452370377|15452274482|15452270888|15452249423|15451424878|15451258379|15451104402|15450711681|15435367283|15423865703|154
23864259|15423862778|15423090185|15421404008|15421305261|15421273217|15420181646|15420011093|15420009581|15419761356|15419761212|15418273846|15417350335|15417279186|15417206986|15415980677|15415503157
|15413569393|15413293846|15412493040|15412000702|15410110312|15409379406|15406671619|15405845918|15405662432|15404843590|15404532892|15404476121|15404311535|15402037809|15401837448|15401229152|1539713
3757|15396087361|15393747205|15393495764|1|2|3|4|5|6|3|7|7|8|K|SGNP|8|100|9|10|11|12|13|14|15|16|17|18|19|20|21|22|23|24|25|26|27|28|29|30|31|32|33|34|35|36|37|38|39|40|41|42|43|44|45|46|47|48|49|50|5
1|52|53|54|55|56|57|58|59|60|61|62|63|64|65|66|67|68|69|70|71|72|73|74|75|76|77|78|79|80|81|82|83|84|85|86|87|88|89|90|91|92|93|94|95|96|97|98|99|100|101|102|103|104|105|106|107|108|
{{< /highlight >}}

Pretty cryptic but the pattern should be clear by now. The numbers on the middle:

{{< highlight sh "linenos=table, linenostart=1" >}}
15496357640|15496349933|15493841873|15491365378|15488910522|15488667774|15488660586|15488525888|15488053264|15487848360|15487912098|15486818166|15485039543|15484640093|15484637666|15484550681|15483826
724|15482043396|15481236007|15480216745|15479965022|15479943539|15479891587|15479382334|15478811147|15475565022|15475419857|15475370542|15475073151|15474052961|15471770500|15471406374|15470918112|1546
8683208|15467229194|15467152209|15467142650|15466683573|15466504143|15466333339|15466281862|15466292312|15465558833|15465107279|15464506738|15464449485|15464316403|15463881116|15462160256|15460884410|
15453412832|15453375839|15452559978|15452370377|15452274482|15452270888|15452249423|15451424878|15451258379|15451104402|15450711681|15435367283|15423865703|15423864259|15423862778|15423090185|15421404
008|15421305261|15421273217|15420181646|15420011093|15420009581|15419761356|15419761212|15418273846|15417350335|15417279186|15417206986|15415980677|15415503157|15413569393|15413293846|15412493040|1541
2000702|15410110312|15409379406|15406671619|15405845918|15405662432|15404843590|15404532892|15404476121|15404311535|15402037809|15401837448|15401229152|15397133757|15396087361|15393747205|15393495764
{{< /highlight >}}

are clearly the email ids. The other requests contained similar payloads. <br /> <br /> OK, the information is there. _How do I get it quickly?_ I did some more random clicking in the network tools. I managed to figure out that there is something like "downloading multiple requests in .har archive file". I have no idea what a ".har" file is and was too lazy to read the [Wikipedia article](https://en.wikipedia.org/wiki/.har). As far as I understand it, it's some description of "what the browser" did and how it did it (cookies, headers, etc.). The idea is that the actions are described in fully reproducible by other browsers way. Or something like that. This ultimately doesn't matter. <br /> <br /> I selected all of the relevant POST requests and I saved a _.har_ file for them. I looked into it and it did contain lots of information. I stared it for some time and I figured that the information I needed was in JSON nodes of the following kind:

{{< highlight sh "linenos=table, linenostart=1" >}}
...
"text":
"7|2|108|https://nm40.abv.bg/mail/|A9281AB8DC456492EBCF569B4D467239|com.google.gwt.user.client.rpc.XsrfToken/4254043109|8BA318BA03057C85E63015BCC3E398A9|bg.abv.mail.sg.client.service.InboxService|move
Messages|J|[Ljava.lang.String;/2600011424|15493841873|15491365378|15488910522|15488667774|15488660586|15488525888|15488053264|15487848360|15487912098|15486818166|15486542791|15485914949|15485039543|15
484640093|15484637666|15484550681|15483826724|15482043396|15481236007|15480216745|15479965022|15479943539|15479891587|15479382334|15478811147|15475565022|15475419857|15475370542|15475073151|1547405296
1|15471770500|15471406374|15470918112|15468683208|15467229194|15467152209|15467142650|15466683573|15466504143|15466333339|15466281862|15466292312|15465558833|15465107279|15464506738|15464449485|154643
16403|15463881116|15462160256|15460884410|15453412832|15453375839|15452559978|15452370377|15452274482|15452270888|15452249423|15451424878|15451258379|15451104402|15450711681|15435367283|15423865703|15
423864259|15423862778|15423090185|15421404008|15421305261|15421273217|15420181646|15420011093|15420009581|15419761356|15419761212|15418273846|15417350335|15417279186|15417206986|15415980677|1541550315
7|15413569393|15413293846|15412493040|15412000702|15410110312|15409379406|15406671619|15405845918|15405662432|15404843590|15404532892|15404476121|15404311535|15402037809|15401837448|15401229152|153971
33757|15396087361|15393747205|15393495764|1|2|3|4|5|6|3|7|7|8|K|SGNP|8|100|9|10|11|12|13|14|15|16|17|18|19|20|21|22|23|24|25|26|27|28|29|30|31|32|33|34|35|36|37|38|39|40|41|42|43|44|45|46|47|48|49|50|
51|52|53|54|55|56|57|58|59|60|61|62|63|64|65|66|67|68|69|70|71|72|73|74|75|76|77|78|79|80|81|82|83|84|85|86|87|88|89|90|91|92|93|94|95|96|97|98|99|100|101|102|103|104|105|106|107|108|",
...
{{< /highlight >}}

Cool! Getting really close now. _How do I get every id out?_ With [grep](https://www.cyberciti.biz/faq/howto-use-grep-command-in-linux-unix/) of course! Some more staring and I notice that a consistent part of what I need was `moveMessages`. The whole string is on one line so if I call something like

```sh
grep "moveMessages.*" requests.har -o
```

This will filter a lot of the information down. In [regex](https://en.wikipedia.org/wiki/Regular%5Fexpression) land "moveMessages.\*" means "First match `moveMessages` and then anything till the end of the line" The `-o` is there so that _grep_ prints only the matching part of the lines that match. A problem I had then was that there was an inconsistent amount of junk between `moveMessages` and the numbers that I needed. At the end I used this:

```sh
grep "moveMessages.*" requests.har -o | grep "|[0-9]{5,}|" -E -o
```

The first _grep_ command is the same as before. The second matches a minimum of 5 digits between two "|"-symbols. The "-E" flag is there so that extended regular expressions can be used. The command as a whole produces a list of ids that I saved in a plain text file. <br /> <br /> _Note:_ There were, however, some numbers that obviously weren't like the others so I filtered the file with yet another _grep_:

```sh
grep "^26" msgs.txt -v > msgs_clean.txt
```

Luckily, all junk messages were starting with "26" so I matched those and inverted the output of _grep_ with the "-v". <br /> <br /> OK, at this point I had all the information I needed to start downloading. _So how exactly am I supposed to do that?_
