org/posts/abv_mails.org
** Doing GET requests "manually"

There is a nifty utility called [[https://curl.haxx.se/][curl]] that can make HTTP requests at some URLs and dump the information on the standard output. When it comes to the task at hand, the intuitive thing to do is to call that email downloading URL with the ids from the previously generated file. This, however, won't work for obvious reasons. When I am logged in my email on my browser and I call the URL... well, I am logged in my email account. The browser probably sends some cookie so that the server on the other side can know that I am in fact allowed to use the URL. If that wasn't the case, everyone could have download my emails given they had the ids of the emails.
\\
\\
/So how did I do it?/ Again, random clicking in the network tools of Firefox lead me to find out that one can save a made request as a "cURL". This means (I presumed) that a /curl/ command is coppied to your clipboard and if executed, it will do /literally/ the same thing as the coppied request. Cookies, headers and payload - everything is in this command. I made the download email request manually in the browser, coppied it as a cURL and it was something like:
#+BEGIN_SRC sh
curl 'https://nm40.abv.bg/email/msgdownload?mid=15496357640&fid=10' \
 -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:66.0) Gecko/20100101 Firefox/66.0' \
 -H 'Accept:text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' \
 -H 'Accept-Language: en-US,en;q=0.5' \
 --compressed \
 -H 'Referer: https://nm40.abv.bg/Mail.html' \
 -H 'Connection: keep-alive' \
 -H 'Cookie: ...'\
 -H 'TE: Trailers'
#+END_SRC
(Here I've taken out the cookies of course. I wouldn't want you to steal my session 😉.) In the URL there is again that ~mid~ parameter. Cool! I wrote a very simple bash script that will just take its first argument and put it at the right place.

/get.sh:/
#+BEGIN_SRC sh
curl "https://nm40.abv.bg/email/msgdownload?mid=${1}&fid=10" \
 -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:66.0) Gecko/20100101 Firefox/66.0' \
 -H 'Accept:text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' \
 -H 'Accept-Language: en-US,en;q=0.5' \
 --compressed \
 -H 'Referer: https://nm40.abv.bg/Mail.html' \
 -H 'Connection: keep-alive' \
 -H 'Cookie: ...'\
 -H 'TE: Trailers'
#+END_SRC
/Note:/ You have to use double quotations when using variables inside strings. It's because of how variables are resolved in bash.
\\
\\
I can now call the script with an arbitrary email id and redirect the output to a file and have that email to be downloaded in the file:
#+BEGIN_SRC sh
./get.sh 1512783 > 1512783.txt
#+END_SRC
I did that and lo and behold - it worked! Now I just had to do that for every id in my ids file. Of course, this is a trivial job when you know your [[https://www.gnu.org/software/coreutils/][GNU Core Utilities]]. The final command was:
#+BEGIN_SRC sh
cat msgs_clean.txt | xargs -I{} sh -c "./get.sh {} > {}.eml"
#+END_SRC
xargs takes strings from the standard input, substitutes them in the given command and runs the command. The "given command" is ~./get.sh {} > mails/{}.eml~ and the "{}" gets substituted with the read email id.
\\
\\
I ran the command and after an hour or so, I had a directory full of /.eml/ files. *Success!*


* Further doing "whatever you want"
At this point I have all of my emails but what the hell can I do with all of those /.eml/  files. I could open them in some email client ([[https://www.thunderbird.net/en-US/][Thunderbird]] for examples) but bulk processing them probably won't be fun experience.
\\
\\
It turns out that GNU\Linux provides yet another utility that does something handy - [[https://www.djcbsoftware.nl/code/mu/][Mu]]. /Mu/ can do a lot and it is a really capable program. You can read about it on its website. Here I want to mention just a couple of thing I've found so far. Even if I am not using /mu/ to its full extend, I am sure I can accomplish a lot when it comes to organizing my emails and making them "cleaner for reading".
\\
\\
First off with ~mu view email.eml~ one can nicely format a /.eml/ file. The output is directly on the standard out so I can do whatever I want with it. The command also displays the headers of the email so the information like sender, receiver, date, etc. is also displayed. This means that I can ~mu view~ all the files and /grep/ something specific. For example, with
#+BEGIN_SRC sh
mu view *.eml | grep "^Subject:"
#+END_SRC
I get a list of all subjects. With
#+BEGIN_SRC sh
mu view *.eml | grep "^Date:"
#+END_SRC
a list of all dates. Only with this I can easily create a script that goes over the emails, formats them in plain text files, puts every email in a separate folder and groups the folders by month. Or like that. All those GNU utilities together with /mu/ make the organization pretty limitless.
\\
\\
Another feature of /mu/ is the ability to extract attached files from /.eml/ files. With
#+BEGIN_SRC sh
mu extract email.eml --save-all --target-dir ./ 
#+END_SRC
one can extract all of the attachments of a given /.eml/ file and put them in the current folder. With that I can further bring order to my emails. An idea would be to have one folder per month, the each month folder - a whole lots of folders for each email with plain text, attachments and some meta data. As said, endless opportunities for nicely structured email archive.


** Doing it properly
At this point I have to mention that the whole "organization" consideration can be vastly simpler when done properly. /Mu/ can be used together with [[http://www.offlineimap.org/][OfflineIMAP]]. /OfflineIMAP/ allows you to download all of your emails on a server (that supports /IMAP/, of course) and save them in local [[https://en.wikipedia.org/wiki/Maildir][Maildirs]]. /Mu/, on the other hand, when used correctly can be used to index and query emails to extract some useful information from them. One can further use some email client to have their emails visualized ([[https://neomutt.org/][neomutt]] or [[https://www.djcbsoftware.nl/code/mu/mu4e.html][Mu4e]]). It is possible to keep all of your emails locally on your computer and syncing them periodically with some remote server.
\\
With that being said, I am not exactly sure how predownloaded /.eml/ files fit this whole narrative. Can I have my old, archived mails in /.eml/ format along side my active emails on Gmail? I'll have to do some digging in order to be able to answer that.


* Conclusion
Those were my two cents on emails so far. I am actually surprised that I succeeded in getting a hold of my data. Transitioning between email addresses is proving to be quite the challenge but now at least I have everything online so I won't be loosing anything.
\\
I do understand that this blog post is highly specific and the vast majority of the readers cannot directly extract value out of it. Still, I found the whole process interesting in the way I "hacekd" my way to the solution of the problem. With that I think I can at least show you that a lot of things are possible when you know where to look and how to use the tools that you have at your disposal.
\\
A brief summery of the thing to remember would be:
- Think how you can use the APIs of different websites to do what you want.
- Know your GNU Coreutils. They are useful and save time.
- The network analyze tools of Firefox are your friend. Use them!
- /Curl/ can simulate sessions through sending the appropriate cookies while making requests.- 

#  LocalWords:  coppied cURL predownloaded Coreutils Bourne
