content/posts/abv_mails.md


### Doing GET requests "manually" {#doing-get-requests-manually}

There is a nifty utility called [curl](https://curl.haxx.se/) that can make HTTP requests at some URLs and dump the information on the standard output. When it comes to the task at hand, the intuitive thing to do is to call that email downloading URL with the ids from the previously generated file. This, however, won't work for obvious reasons. When I am logged in my email on my browser and I call the URL... well, I am logged in my email account. The browser probably sends some cookie so that the server on the other side can know that I am allowed to use the URL. If that wasn't the case, everyone could have downloaded my emails given they had the ids of the emails. <br /> <br /> _So how did I do it?_ Again, random clicking in the network tools of Firefox lead me to find out that one can save a made request as a "cURL". This means (I presumed) that a _curl_ command is copied to your clipboard and if executed, it will do _literally_ the same thing as the copied request. Cookies, headers, and payload - everything is in this command. I made the download email request manually in the browser, copied it as a cURL and it was something like:

```sh
curl 'https://nm40.abv.bg/email/msgdownload?mid=15496357640&fid=10' \
 -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:66.0) Gecko/20100101 Firefox/66.0' \
 -H 'Accept:text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' \
 -H 'Accept-Language: en-US,en;q=0.5' \
 --compressed \
 -H 'Referer: https://nm40.abv.bg/Mail.html' \
 -H 'Connection: keep-alive' \
 -H 'Cookie: ...'\
 -H 'TE: Trailers'
```

(Here I've taken out the cookies of course. I wouldn't want you to steal my session 😉.) In the URL there is again that `mid` parameter. Cool! I wrote a very simple bash script that will just take its first argument and put it in the right place.

_get.sh:_

```sh
curl "https://nm40.abv.bg/email/msgdownload?mid=${1}&fid=10" \
 -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:66.0) Gecko/20100101 Firefox/66.0' \
 -H 'Accept:text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' \
 -H 'Accept-Language: en-US,en;q=0.5' \
 --compressed \
 -H 'Referer: https://nm40.abv.bg/Mail.html' \
 -H 'Connection: keep-alive' \
 -H 'Cookie: ...'\
 -H 'TE: Trailers'
```

_Note:_ You have to use double quotations when using variables inside strings. It's because of how variables are resolved in bash. <br /> <br /> I can now call the script with an arbitrary email id and redirect the output to a file and have that email to be downloaded in the file:

```sh
./get.sh 1512783 > 1512783.txt
```

I did that and lo and behold - it worked! Now I just had to do that for every id in my ids file. Of course, this is a trivial job when you know your [GNU Core Utilities](https://www.gnu.org/software/coreutils/). The final command was:

```sh
cat msgs_clean.txt | xargs -I{} sh -c "./get.sh {} > {}.eml"
```

xargs takes strings from the standard input, substitutes them in the given command and runs the command. The "given command" is `./get.sh {} > mails/{}.eml` and the "{}" gets substituted with the read email id. <br /> <br /> I ran the command and after an hour or so, I had a directory full of _.eml_ files. **Success!**


## Further doing "whatever you want" {#further-doing-whatever-you-want}

At this point I have all of my emails but what the hell can I do with all of those _.eml_ files. I could open them in some email clients ([Thunderbird](https://www.thunderbird.net/en-US/) for examples) but bulk processing them probably won't be a fun experience.

<br />

It turns out that GNU\Linux provides yet another utility that does something handy - [Mu](https://www.djcbsoftware.nl/code/mu/). _Mu_ can do a lot and it is a really capable program. You can read about it on its website. Here I want to mention just a couple of things I've found so far. Even if I am not using _mu_ to its full extent, I am sure I can accomplish a lot when it comes to organizing my emails and making them "cleaner for reading".

<br />

First off with `mu view email.eml` one can nicely format a _.eml_ file. The output is directly on the standard out so I can do whatever I want with it. The command also displays the headers of the email so the information like sender, receiver, date, etc. is also displayed. This means that I can `mu view` all the files and _grep_ something specific. For example, with

```sh
mu view *.eml | grep "^Subject:"
```

I get a list of all the subjects. With

```sh
mu view *.eml | grep "^Date:"
```

a list of all dates. Only with this I can easily create a script that goes over the emails, formats them in plain text files, puts every email in a separate folder and groups the folders by month. Or like that. All those GNU utilities together with _mu_ make the organization pretty limitless.

<br />

Another feature of _mu_ is the ability to extract attached files from _.eml_ files. With

```sh
mu extract email.eml --save-all --target-dir ./
```

one can extract all of the attachments of a given _.eml_ file and put them in the current folder. With that, I can further bring order to my emails. An idea would be to have one folder per month. In each month-folder, we can then have several subfolders for different parts of the emails for this month - plain text, attachments, and metadata. As said, endless opportunities for a nicely structured email archive.


### Doing it properly {#doing-it-properly}

At this point I have to mention that the whole "organization" consideration can be vastly simpler when done properly. _Mu_ can be used together with [OfflineIMAP](http://www.offlineimap.org/). _OfflineIMAP_ allows you to download all of your emails on a server (that supports _IMAP_, of course) and save them in local [Maildirs](https://en.wikipedia.org/wiki/Maildir). _Mu_, on the other hand, when used correctly can be used to index and query emails to extract some useful information from them. One can further use some email client to have their emails visualized ([neomutt](https://neomutt.org/) or [Mu4e](https://www.djcbsoftware.nl/code/mu/mu4e.html)). It is possible to keep all of your emails locally on your computer and syncing them periodically with some remote server. <br /> With that being said, I am not exactly sure how predownloaded _.eml_ files fit this whole narrative. Can I have my old, archived mails in _.eml_ format along side my active emails on Gmail? I'll have to do some digging in order to be able to answer that.


## Conclusion {#conclusion}

Those were my two cents on emails so far. I am surprised that I succeeded in getting a hold of my data. Transitioning between email addresses is proving to be quite the challenge but now at least I have everything online so I won't be losing anything. <br /> I do understand that this blog post is highly specific and the vast majority of the readers cannot directly extract value out of it. Still, I found the whole process interesting in the way I "hacked" my way to the solution of the problem. With that, I think I can at least show you that a lot of things are possible when you know where to look and how to use the tools that you have at your disposal. <br /> A brief summary of the thing to remember would be:

-   Think about how you can use the APIs of different websites to do what you want.
-   Know your GNU Coreutils. They are useful and save time.
-   The network-analyze tools of Firefox are your friend. Use them!
-   _Curl_ can simulate sessions by sending the appropriate cookies while making requests.
